app/views/dashboard/index.html.erb

      </div>
    <% elsif Invoice.any? %>
---
SELECT 1 AS one FROM "invoices" LIMIT 1