app/views/dashboard/index.html.erb

          <strong>Last Sync:</strong>
          <% if XeroContact.any? %>
            <%= time_ago_in_words(XeroContact.maximum(:last_synced_at)) %> ago
---
SELECT COUNT(*) FROM "xero_contacts"
SELECT MAX("xero_contacts"."last_synced_at") FROM "xero_contacts"

      <div class="space-y-2 text-sm">
        <div><strong>Total:</strong> <%= Organization.count %></div>
---
SELECT COUNT(*) FROM "organizations"

        <div><strong>Suppliers:</strong> <%= Organization.suppliers.count %></div>
        <div><strong>Xero Contacts:</strong> <%= XeroContact.count %></div>
---
SELECT COUNT(*) FROM "xero_contacts"

      <div class="space-y-2 text-sm">
        <div><strong>Total Invoices:</strong> <%= Invoice.count %></div>
        <div><strong>Draft:</strong> <%= Invoice.draft.count %></div>
        <div><strong>Synced with Xero:</strong> <%= Invoice.synced.count %></div>
---
SELECT COUNT(*) FROM "invoices"
SELECT COUNT(*) FROM "invoices" WHERE "invoices"."xero_id" IS NULL

    </div>
  <% elsif Invoice.any? %>
---
SELECT 1 AS one FROM "invoices" LIMIT 1