app/views/customer_orders/index.html.erb

            <td class="px-6 py-4 whitespace-nowrap text-sm text-gray-900">
              <%= customer_order.works_orders.count %>
---
SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."customer_order_id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1'
SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."customer_order_id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1'