app/views/customer_orders/show.html.erb

SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."customer_order_id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1'
---
    invoiced_count = invoiced_release_notes.sum(:quantity_accepted)
    total_released = @customer_order.works_orders.active.sum(:quantity_released)