app/views/parts/index.html.erb

SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."part_id" IN ('bbfa0ec3-38d5-4998-926c-31ebf9ff3ebc', '72865932-28df-4166-ac4e-27c33846c5bb')
SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."part_id" = '72865932-28df-4166-ac4e-27c33846c5bb'
---
            <td class="px-6 py-4 whitespace-nowrap text-sm text-gray-900">
              <%= part.works_orders.active.count %>