app/views/parts/show.html.erb

SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."part_id" = '7b54face-4bc1-4b69-b395-2cf0c43a25cd'
---
          <dt class="text-sm font-medium text-gray-500">Total Works Orders</dt>
          <dd class="text-sm text-gray-900 font-semibold"><%= @part.works_orders.count %></dd>

SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."part_id" = '7b54face-4bc1-4b69-b395-2cf0c43a25cd' AND "works_orders"."voided" = FALSE
---
          <dt class="text-sm font-medium text-gray-500">Active Works Orders</dt>
          <dd class="text-sm text-gray-900 font-semibold"><%= @part.works_orders.where(voided: false).count %></dd>

SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."part_id" = '7b54face-4bc1-4b69-b395-2cf0c43a25cd' AND "works_orders"."is_open" = TRUE
---
          <dt class="text-sm font-medium text-gray-500">Open Works Orders</dt>
          <dd class="text-sm text-gray-900 font-semibold"><%= @part.works_orders.where(is_open: true, voided: false).count %></dd>