app/views/release_notes/index.html.erb

      <p class="text-2xl font-bold text-orange-600">
        <%= ReleaseNote.requires_invoicing.count %>
---
SELECT COUNT(*) FROM "release_notes"

      <p class="text-2xl font-bold text-blue-600">
        <%= ReleaseNote.joins(:invoice_item).count %>
---
SELECT COUNT(*) FROM "release_notes" INNER JOIN "invoice_items" ON "invoice_items"."release_note_id" = "release_notes"."id"

      <p class="text-2xl font-bold text-red-600">
        <%= ReleaseNote.voided.count %>
---
SELECT COUNT(*) FROM "release_notes" WHERE "release_notes"."voided" = TRUE