app/views/works_orders/index.html.erb

                <%= link_to works_order.part_number, part_path(works_order.part), class: "text-blue-600 hover:text-blue-900 font-medium" %>
                <% if works_order.part.description.present? %>
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = 'bbfa0ec3-38d5-4998-926c-31ebf9ff3ebc'