app/views/works_orders/show.html.erb

SELECT "customer_orders".* FROM "customer_orders" WHERE "customer_orders"."id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1' LIMIT 1
SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."id" = '909112d9-cc1e-439a-88fb-48cb781c31f2' LIMIT 1
---
        </span>
      <% elsif WorksOrder.where(part_id: @works_order.part_id).count > 1 ||
            @works_order.customer_order.contract_reviewed? %>

SELECT 1 AS one FROM "release_notes" WHERE "release_notes"."works_order_id" = '909112d9-cc1e-439a-88fb-48cb781c31f2' LIMIT 1
---

    <% if @works_order.release_notes.any? %>