app/controllers/artifacts_controller.rb

SELECT COUNT(*) FROM "release_levels"
SELECT COUNT(*) FROM "release_levels" WHERE "release_levels"."enabled" = TRUE
SELECT COUNT(*) FROM "transport_methods"
SELECT COUNT(*) FROM "transport_methods" WHERE "transport_methods"."enabled" = TRUE
---
  def index
    # Load counts for all artifact types
    @release_levels_count = ReleaseLevel.count
    @enabled_release_levels_count = ReleaseLevel.enabled.count

    @transport_methods_count = TransportMethod.count
    @enabled_transport_methods_count = TransportMethod.enabled.count