app/controllers/customer_orders_controller.rb

  def index
    @customer_orders = CustomerOrder.includes(:customer, :works_orders)

    if params[:customer_id].present?
      @customer_orders = @customer_orders.for_customer(params[:customer_id])
    end

    case params[:status]
    when 'outstanding'
      @customer_orders = @customer_orders.outstanding
    when 'voided'
      @customer_orders = @customer_orders.voided
    when 'active'
      @customer_orders = @customer_orders.active
    end

    if params[:search].present?
      search_term = params[:search].strip
      @customer_orders = @customer_orders.joins(:customer)
                                        .where(
                                          "customer_orders.number ILIKE ? OR organizations.name ILIKE ?",
                                          "%#{search_term}%", "%#{search_term}%"
                                        )
    end

    @customers = Organization.enabled.order(:name)

    @customer_orders = @customer_orders.order(
      Arel.sql("
        CASE
          WHEN customer_orders.voided = true THEN 4
          WHEN customer_orders.fully_released_works_orders_count = customer_orders.open_works_orders_count
               AND customer_orders.open_works_orders_count > 0
               AND customer_orders.uninvoiced_accepted_quantity > 0 THEN 0
          WHEN customer_orders.open_works_orders_count > 0
               AND customer_orders.fully_released_works_orders_count > 0
               AND customer_orders.fully_released_works_orders_count < customer_orders.open_works_orders_count THEN 1
          WHEN customer_orders.open_works_orders_count > 0
               AND customer_orders.uninvoiced_accepted_quantity = 0 THEN 3
          ELSE 2
        END
      "),
      date_received: :desc
    ).page(params[:page]).per(20)
---
SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."customer_order_id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1'
SELECT "customer_orders".* FROM "customer_orders" ORDER BY "customer_orders"."date_received" DESC
SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."customer_order_id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1' AND "works_orders"."voided" = FALSE

  def create
    @customer_order = CustomerOrder.new(customer_order_params)

    if @customer_order.save
---
INSERT INTO "customer_orders" ("customer_id", "number", "date_received", "voided", "created_at", "updated_at") VALUES ('6affe4b1-d24d-4655-b939-17f5aa01d88e', '1', '2025-08-14', FALSE, '2025-08-14 06:45:09.947439', '2025-08-14 06:45:09.947439') RETURNING "id"

  def set_customer_order
    @customer_order = CustomerOrder.find(params[:id])
---
SELECT "customer_orders".* FROM "customer_orders" WHERE "customer_orders"."id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1' LIMIT 1