app/controllers/dashboard_controller.rb

  def index
    # Check Xero connection status - only for users who can see Xero integration
    if Current.user.sees_xero_integration?
      @xero_connected = xero_connected?
      @pending_invoices = Invoice.draft.includes(:customer)
    else
      @xero_connected = false
      @pending_invoices = Invoice.none # Empty collection for non-Xero users
    end

    # General dashboard metrics available to all users
    @total_organizations = Organization.count
    @total_customers = Organization.customers.count
    @total_suppliers = Organization.suppliers.count
    @total_xero_contacts = XeroContact.count
    @total_invoices = Invoice.count
---
SELECT COUNT(*) FROM "organizations"
SELECT COUNT(*) FROM "xero_contacts"
SELECT COUNT(*) FROM "invoices"

  def load_management_metrics
    # Metrics for management and production planning (Chris Bayliss, Phil Bayliss, Tariq Anwar, Julia Chapman)
    @total_revenue_pending = @pending_invoices.sum(:total_inc_tax) if Current.user.sees_xero_integration?
---
SELECT "users".* FROM "users" WHERE "users"."id" = '52d38d4d-3b20-4e3c-a6e7-b579d9dc53e5' LIMIT 1