app/controllers/parts_controller.rb

  def index
    @parts = Part.includes(:customer, :works_orders)
                 .order(:uniform_part_number, :uniform_part_issue)

    # Filter by customer if provided
    if params[:customer_id].present?
      @parts = @parts.for_customer(params[:customer_id])
    end

    # Filter by enabled status
    case params[:status]
    when 'enabled'
      @parts = @parts.enabled
    when 'disabled'
      @parts = @parts.where(enabled: false)
    end

    # Search by part number or issue
    if params[:search].present?
      search_term = Part.make_uniform(params[:search])
      @parts = @parts.where(
        "uniform_part_number ILIKE ? OR uniform_part_issue ILIKE ?",
        "%#{search_term}%", "%#{search_term}%"
      )
    end

    # For the filter dropdown - show all organizations
    @customers = Organization.enabled.order(:name)
---
SELECT "parts".* FROM "parts" ORDER BY "parts"."uniform_part_number" ASC, "parts"."uniform_part_issue" ASC
SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."part_id" IN ('bbfa0ec3-38d5-4998-926c-31ebf9ff3ebc', '72865932-28df-4166-ac4e-27c33846c5bb')
SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."part_id" = '72865932-28df-4166-ac4e-27c33846c5bb'
SELECT "organizations".* FROM "organizations" WHERE "organizations"."enabled" = TRUE ORDER BY "organizations"."name" ASC

  def new
    @part = Part.new
    @customers = Organization.enabled.order(:name)
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."enabled" = TRUE ORDER BY "organizations"."name" ASC

  def create
    Rails.logger.info "🔍 Raw Params: #{params.inspect}"
    Rails.logger.info "🔍 Part Params: #{part_params.inspect}"
    Rails.logger.info "🔍 Switch to Manual: #{params[:switch_to_manual]}"

    @part = Part.new(part_params)

    Rails.logger.info "🔍 Part before save: customer_id=#{@part.customer_id}, part_number=#{@part.uniform_part_number}, part_issue=#{@part.uniform_part_issue}"

    # Set defaults for new parts with processing instructions
    @part.process_type = determine_process_type if @part.process_type.blank?
---
SELECT "parts".* FROM "parts" WHERE "parts"."customer_id" = '6affe4b1-d24d-4655-b939-17f5aa01d88e' AND "parts"."uniform_part_number" = '1' AND "parts"."uniform_part_issue" = 'A' LIMIT 1
SELECT 1 AS one FROM "parts" WHERE "parts"."uniform_part_number" = '1' AND "parts"."customer_id" = '6affe4b1-d24d-4655-b939-17f5aa01d88e' AND "parts"."uniform_part_issue" = 'A' LIMIT 1

      end
    end

    if @part.save
---
INSERT INTO "parts" ("customer_id", "uniform_part_number", "uniform_part_issue", "description", "material", "specification", "notes", "enabled", "created_at", "updated_at") VALUES ('6affe4b1-d24d-4655-b939-17f5aa01d88e', '1', 'A', NULL, NULL, NULL, NULL, TRUE, '2025-08-20 14:17:23.085194', '2025-08-20 14:17:23.085194') RETURNING "id"