app/controllers/parts_controller.rb

  def index
    @parts = Part.includes(:customer)
                .order(:part_number, :part_issue)

    # Search by part number, issue, customer name, specification, description or material
    if params[:search].present?
      term = "%#{params[:search].strip}%"
      @parts = @parts.joins(:customer).where(
        "parts.part_number ILIKE :q OR " \
        "parts.part_issue ILIKE :q OR " \
        "organizations.name ILIKE :q OR " \
        "parts.specification ILIKE :q OR " \
        "parts.description ILIKE :q OR " \
        "parts.material ILIKE :q",
        q: term
      )
    end

    # Add pagination (using kaminari gem)
    @parts = @parts.page(params[:page]).per(25) # 25 parts per page

    # Works-order counts for just this page's parts — two flat queries, no N+1,
    # no loading WO rows into memory. active == voided: false.
    part_ids          = @parts.map(&:id)
    @total_wo_counts  = WorksOrder.where(part_id: part_ids).group(:part_id).count
---
SELECT COUNT(*) FROM "works_orders" WHERE "works_orders"."part_id" = '72865932-28df-4166-ac4e-27c33846c5bb'

      # ENP settings etc.) so the new part knows what processes it uses.
      # This drives film reading requirements during booking out.
      if params[:source_part_id].present?
        source_part = Part.find_by(id: params[:source_part_id])
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = '7b54face-4bc1-4b69-b395-2cf0c43a25cd' LIMIT 1