app/controllers/part_processing_instructions_controller.rb

  def new
    @ppi = PartProcessingInstruction.new

    # If coming from a specific part, pre-populate
    if params[:part_id].present?
      @part = Part.find(params[:part_id])
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = '7b54face-4bc1-4b69-b395-2cf0c43a25cd' LIMIT 1