app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email_address", "password_digest", "username", "full_name", "enabled", "created_at", "updated_at") VALUES ('brian@hardanodisingstl.com', '$2a$12$EtButkoKGoYLzUPt.GM0fuUOkQvwNITcMS1r1WbFXSWCrF8cPfpSO', 'Brian', 'Brian Benton ', TRUE, '2025-08-12 07:32:56.002632', '2025-08-12 07:32:56.002632') RETURNING "id"