app/controllers/release_levels_controller.rb

  def index
    @release_levels = ReleaseLevel.all.order(:name)
---
SELECT "release_levels".* FROM "release_levels" ORDER BY "release_levels"."name" ASC

  def create
    @release_level = ReleaseLevel.new(release_level_params)

    if @release_level.save
---
INSERT INTO "release_levels" ("name", "statement", "enabled", "created_at", "updated_at") VALUES ('Test spec', 'Test specification Statement', TRUE, '2025-08-14 09:10:48.608546', '2025-08-14 09:10:48.608546') RETURNING "id"