app/controllers/release_notes_controller.rb

SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."id" = '909112d9-cc1e-439a-88fb-48cb781c31f2' LIMIT 1
---
  def set_works_order
    @works_order = WorksOrder.find(params[:works_order_id]) if params[:works_order_id]