app/controllers/release_notes_controller.rb

SELECT "release_notes".* FROM "release_notes" ORDER BY "release_notes"."number" DESC
SELECT COUNT(*) FROM "release_notes" INNER JOIN "invoice_items" ON "invoice_items"."release_note_id" = "release_notes"."id"
---
  def index
    @release_notes = ReleaseNote.includes(:works_order, :issued_by, :invoice_item)
                                .order(number: :desc)

    case params[:status]
    when 'active'
      @release_notes = @release_notes.active
    when 'voided'
      @release_notes = @release_notes.voided
    when 'pending_invoice'
      @release_notes = @release_notes.requires_invoicing
    when 'invoiced'
      @release_notes = @release_notes.joins(:invoice_item)
    end

    if params[:customer_id].present?
      @release_notes = @release_notes.joins(works_order: { customer_order: :customer })
                                     .where(customer_orders: { customer_id: params[:customer_id] })
    end

    if params[:search].present?
      @release_notes = @release_notes.where("number::text ILIKE ?", "%#{params[:search]}%")
    end

    @customers = Organization.customers.enabled.order(:name)
    @release_notes = @release_notes.page(params[:page]).per(20)

SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."id" = '909112d9-cc1e-439a-88fb-48cb781c31f2' LIMIT 1
---
  def set_works_order
    @works_order = WorksOrder.find(params[:works_order_id]) if params[:works_order_id]