app/controllers/sessions_controller.rb

  def create
    email = params[:email_address]&.strip&.downcase

    if email.present? && email.match?(/@hardanodisingstl\.com\z/)
      user = User.find_by(email_address: email)
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = 'daniel@hardanodisingstl.com' LIMIT 1