app/controllers/transport_methods_controller.rb

SELECT "transport_methods".* FROM "transport_methods" ORDER BY "transport_methods"."name" ASC
---
  def index
    @transport_methods = TransportMethod.all.order(:name)

INSERT INTO "transport_methods" ("name", "enabled", "description", "created_at", "updated_at") VALUES ('collection', TRUE, 'collection', '2025-08-14 08:57:02.997792', '2025-08-14 08:57:02.997792') RETURNING "id"
---
  def create
    @transport_method = TransportMethod.new(transport_method_params)

    if @transport_method.save

SELECT "transport_methods".* FROM "transport_methods" WHERE "transport_methods"."id" = '3a28a8ef-6591-4538-adbd-1c19d7973efc' LIMIT 1
---
  def set_transport_method
    @transport_method = TransportMethod.find(params[:id])