app/controllers/works_orders_controller.rb

  def new
    # Prevent browser caching
    response.headers['Cache-Control'] = 'no-cache, no-store, max-age=0, must-revalidate'
    response.headers['Pragma'] = 'no-cache'
    response.headers['Expires'] = '0'

    @works_order = WorksOrder.new

    # If coming from nested route, pre-select the customer order
    if params[:customer_order_id].present?
      @customer_order = CustomerOrder.find(params[:customer_order_id])
---
SELECT "customer_orders".* FROM "customer_orders" WHERE "customer_orders"."id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1' LIMIT 1

  def create
    @works_order = WorksOrder.new(works_order_params)

    # If customer_order_id is missing, try to get it from the route
    if @works_order.customer_order_id.blank? && params[:customer_order_id].present?
      @works_order.customer_order_id = params[:customer_order_id]
    end

    # Set up the part automatically
    if setup_part(@works_order)
      if @works_order.save
---
INSERT INTO "works_orders" ("number", "customer_order_id", "part_id", "ppi_id", "release_level_id", "transport_method_id", "customer_order_line", "part_number", "part_issue", "part_description", "quantity", "quantity_released", "is_open", "voided", "lot_price", "price_type", "each_price", "material", "batch", "customised_process_data", "created_at", "updated_at") VALUES (NULL, 'd82c2929-308f-44a3-8b1e-dad1044cffe1', '72865932-28df-4166-ac4e-27c33846c5bb', NULL, '25a0eb14-2b8d-4c0e-92d4-6bbaee4aba0a', '3a28a8ef-6591-4538-adbd-1c19d7973efc', NULL, 'WIDGET001', 'A', 'Test Widget Component', 12, 0, TRUE, FALSE, 250.0, 'lot', NULL, NULL, NULL, '{}', '2025-08-14 10:39:18.444108', '2025-08-14 10:39:18.444108') RETURNING "id"

  def set_works_order
    @works_order = WorksOrder.find(params[:id])
---
SELECT "works_orders".* FROM "works_orders" WHERE "works_orders"."id" = '909112d9-cc1e-439a-88fb-48cb781c31f2' LIMIT 1

  def load_reference_data
    @release_levels = ReleaseLevel.enabled.ordered
    @transport_methods = TransportMethod.enabled.ordered
    @additional_charge_presets = AdditionalChargePreset.enabled.ordered

    if @customer_order.present?
      Rails.logger.info "🔍 Loading parts for customer: #{@customer_order.customer.name} (ID: #{@customer_order.customer.id})"

      @parts = Part.enabled
                  .for_customer(@customer_order.customer)
                  .includes(:customer)
                  .order(:uniform_part_number)

      Rails.logger.info "🔍 Found #{@parts.count} parts in controller"
      Rails.logger.info "🔍 Part IDs: #{@parts.pluck(:id)}"

      # Force query execution and count from database
      db_count = Part.enabled.for_customer(@customer_order.customer).count
---
SELECT DISTINCT "parts".* FROM "parts" INNER JOIN "part_processing_instructions" ON "part_processing_instructions"."part_id" = "parts"."id" WHERE "parts"."enabled" = TRUE AND "parts"."customer_id" = '6affe4b1-d24d-4655-b939-17f5aa01d88e' AND "part_processing_instructions"."customer_id" = '6affe4b1-d24d-4655-b939-17f5aa01d88e' AND "part_processing_instructions"."enabled" = TRUE ORDER BY "parts"."uniform_part_number" ASC
SELECT COUNT(*) FROM "parts" WHERE "parts"."enabled" = TRUE AND "parts"."customer_id" = '6affe4b1-d24d-4655-b939-17f5aa01d88e'
SELECT COUNT(*) FROM "release_levels" WHERE "release_levels"."enabled" = TRUE
SELECT COUNT(*) FROM "transport_methods" WHERE "transport_methods"."enabled" = TRUE

  def load_form_data_for_errors
    if params[:customer_order_id].present?
      @customer_order = CustomerOrder.find(params[:customer_order_id])
---
SELECT "customer_orders".* FROM "customer_orders" WHERE "customer_orders"."id" = 'd82c2929-308f-44a3-8b1e-dad1044cffe1' LIMIT 1