app/models/sequence.rb

SELECT "sequences".* FROM "sequences" WHERE "sequences"."key" = 'works_order_number' LIMIT 1 FOR UPDATE
UPDATE "sequences" SET "value" = COALESCE("value", 0) + 1 WHERE "sequences"."id" = 'ccd0b878-5c70-40cb-8b17-d772fc08a20c'
---
  def self.next_value(key)
    transaction do
      sequence = lock.find_by!(key: key)
      sequence.increment!(:value)